router1--------------------------
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int f0/0
R1(config-if)#ip add 172.20.0.1 255.255.0.0
R1(config-if)#no shut
R1(config-if)#exit
*Mar  1 00:01:44.967: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state t                                                                                                                                                                                              o up
*Mar  1 00:01:45.967: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                                                                                                                                                                                              et0/0, changed state to up
R1(config-if)#exit
R1(config)#int f0/1
R1(config-if)#ip add 192.168.10.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#ex
*Mar  1 00:02:37.147: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state t                                                                                                                                                                                              o up
*Mar  1 00:02:38.147: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthern                                                                                                                                                                                              et0/1, changed state to upi
R1(config-if)#exit
R1(config)#int s0/0
R1(config-if)#ip add 172.21.0.5 255.255.255.252
R1(config-if)#no shut
R1(config-if)#exit
*Mar  1 00:03:35.447: %LINK-3-UPDOWN: Interface Serial0/0, changed state to up
*Mar  1 00:03:36.447: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0,                                                                                                                                                                                               changed state to up
R1(config-if)#exit
R1(config)#
*Mar  1 00:04:01.951: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0,                                                                                                                                                                                               changed state to down
R1(config)#ip dhcp pool p20
R1(dhcp-config)#network 172.20.0.0 255.255.0.0
R1(dhcp-config)#default-router 172.20.0.1
R1(dhcp-config)#exit
R1(config)#ip dhcp pool p10
R1(dhcp-config)#network 192.168.10.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.10.1
R1(dhcp-config)#exit
R1(config)#
*Mar  1 00:14:31.943: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0,                                                                                                                                                                                               changed state to up
R1(config)#write
             ^
% Invalid input detected at '^' marker.

R1(config)#exit
R1#
*Mar  1 00:19:43.771: %SYS-5-CONFIG_I: Configured from console by console
R1#write
Building configuration...
[OK]
R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.10.0/24 is directly connected, FastEthernet0/1
     172.21.0.0/30 is subnetted, 1 subnets
C       172.21.0.4 is directly connected, Serial0/0
C    172.20.0.0/16 is directly connected, FastEthernet0/0
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router rip
R1(config-router)#network 172.20.0.0
R1(config-router)#network 192.168.10.0
R1(config-router)#network 172.21.0.4
R1(config-router)#ver 2
R1(config-router)#exit
R1(config)#exit
R1#
*Mar  1 00:35:54.687: %SYS-5-CONFIG_I: Configured from console by console
R1#write
Building configuration...
[OK]
R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.10.0/24 is directly connected, FastEthernet0/1
     172.21.0.0/30 is subnetted, 1 subnets
C       172.21.0.4 is directly connected, Serial0/0
C    172.20.0.0/16 is directly connected, FastEthernet0/0
R    192.168.11.0/24 [120/1] via 172.21.0.6, 00:00:18, Serial0/0
R1#

pc1-------------------------------
PC1> ip dhcp
DDORA IP 172.20.0.2/16 GW 172.20.0.1

PC1> show ip

NAME        : PC1[1]
IP/MASK     : 172.20.0.2/16
GATEWAY     : 172.20.0.1
DNS         :
DHCP SERVER : 172.20.0.1
DHCP LEASE  : 86354, 86400/43200/75600
MAC         : 00:50:79:66:68:00
LPORT       : 10030
RHOST:PORT  : 127.0.0.1:10031
MTU:        : 1500

PC1> save
Saving startup configuration to startup.vpc
.  done

PC1> ping 192.168.11.3
*172.20.0.1 icmp_seq=1 ttl=255 time=30.155 ms (ICMP type:3, code:1, Destination host unreachable)
*172.20.0.1 icmp_seq=2 ttl=255 time=15.320 ms (ICMP type:3, code:1, Destination host unreachable)
*172.20.0.1 icmp_seq=3 ttl=255 time=30.841 ms (ICMP type:3, code:1, Destination host unreachable)
*172.20.0.1 icmp_seq=4 ttl=255 time=31.113 ms (ICMP type:3, code:1, Destination host unreachable)
*172.20.0.1 icmp_seq=5 ttl=255 time=30.153 ms (ICMP type:3, code:1, Destination host unreachable)

PC1> ping 192.168.11.3
192.168.11.3 icmp_seq=1 timeout
192.168.11.3 icmp_seq=2 timeout
84 bytes from 192.168.11.3 icmp_seq=3 ttl=62 time=75.618 ms
84 bytes from 192.168.11.3 icmp_seq=4 ttl=62 time=77.056 ms
84 bytes from 192.168.11.3 icmp_seq=5 ttl=62 time=91.650 ms

PC1> save
Saving startup configuration to startup.vpc
.  done


pc2--------------------------
PC2> ip dhcp
DDORA IP 172.20.0.3/16 GW 172.20.0.1

PC2> show ip

NAME        : PC2[1]
IP/MASK     : 172.20.0.3/16
GATEWAY     : 172.20.0.1
DNS         :
DHCP SERVER : 172.20.0.1
DHCP LEASE  : 86356, 86400/43200/75600
MAC         : 00:50:79:66:68:01
LPORT       : 10032
RHOST:PORT  : 127.0.0.1:10033
MTU:        : 1500

PC2> save
Saving startup configuration to startup.vpc
.  done

PC2>


pc3----------------------
PC3> ip dhcp
DDORA IP 192.168.10.2/24 GW 192.168.10.1

PC3> show ip

NAME        : PC3[1]
IP/MASK     : 192.168.10.2/24
GATEWAY     : 192.168.10.1
DNS         :
DHCP SERVER : 192.168.10.1
DHCP LEASE  : 86356, 86400/43200/75600
MAC         : 00:50:79:66:68:02
LPORT       : 10034
RHOST:PORT  : 127.0.0.1:10035
MTU:        : 1500

PC3> save
Saving startup configuration to startup.vpc
.  done

PC3>

pc4--------------------------
PC4> ip dhcp
DDORA IP 192.168.10.3/24 GW 192.168.10.1

PC4> show ip

NAME        : PC4[1]
IP/MASK     : 192.168.10.3/24
GATEWAY     : 192.168.10.1
DNS         :
DHCP SERVER : 192.168.10.1
DHCP LEASE  : 86358, 86400/43200/75600
MAC         : 00:50:79:66:68:03
LPORT       : 10036
RHOST:PORT  : 127.0.0.1:10037
MTU:        : 1500

PC4> save
Saving startup configuration to startup.vpc
.  done

PC4>


router2------------------------
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#int f0/0
R2(config-if)#ip add 192.168.11.1 255.255.255.0
R2(config-if)#no shut
R2(config-if)#exit
*Mar  1 00:12:35.419: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:12:36.419: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to                                                                                                                                                                       up
R2(config-if)#exit
R2(config)#int s0/0
R2(config-if)#ip add 172.21.0.6 255.255.255.252
R2(config-if)#no shut
R2(config-if)#
*Mar  1 00:14:26.331: %LINK-3-UPDOWN: Interface Serial0/0, changed state to up
*Mar  1 00:14:27.331: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up
R2(config-if)#exit
R2(config)#ip dhcp pool p11
R2(dhcp-config)#network 192.168.11.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.11.1
R2(dhcp-config)#exit
R2(config)#exit
R2#
*Mar  1 00:20:06.687: %SYS-5-CONFIG_I: Configured from console by console
R2#write
Building configuration...
[OK]
R2#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     172.21.0.0/30 is subnetted, 1 subnets
C       172.21.0.4 is directly connected, Serial0/0
C    192.168.11.0/24 is directly connected, FastEthernet0/0
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router rip
R2(config-router)#network 192.168.11.0
R2(config-router)#network 172.21.0.4
R2(config-router)#ver 2
R2(config-router)#exit
R2(config)#exit
R2#save
*Mar  1 00:36:00.083: %SYS-5-CONFIG_I: Configured from console by console
R2#save
Translating "save"

Translating "save"
% Unknown command or computer name, or unable to find computer address
R2#write
Building configuration...
[OK]
R2#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

R    192.168.10.0/24 [120/1] via 172.21.0.5, 00:00:07, Serial0/0
     172.21.0.0/30 is subnetted, 1 subnets
C       172.21.0.4 is directly connected, Serial0/0
R    172.20.0.0/16 [120/1] via 172.21.0.5, 00:00:07, Serial0/0
C    192.168.11.0/24 is directly connected, FastEthernet0/0
R2#


pc5-------------------
PC5> ip dhcp
DDORA IP 192.168.11.2/24 GW 192.168.11.1

PC5> show ip

NAME        : PC5[1]
IP/MASK     : 192.168.11.2/24
GATEWAY     : 192.168.11.1
DNS         :
DHCP SERVER : 192.168.11.1
DHCP LEASE  : 86395, 86400/43200/75600
MAC         : 00:50:79:66:68:04
LPORT       : 10038
RHOST:PORT  : 127.0.0.1:10039
MTU:        : 1500

PC5> save
Saving startup configuration to startup.vpc
.  done

PC5>


pc6-------------------------
PC6> ip dhcp
DDORA IP 192.168.11.3/24 GW 192.168.11.1

PC6> show ip

NAME        : PC6[1]
IP/MASK     : 192.168.11.3/24
GATEWAY     : 192.168.11.1
DNS         :
DHCP SERVER : 192.168.11.1
DHCP LEASE  : 86396, 86400/43200/75600
MAC         : 00:50:79:66:68:05
LPORT       : 10040
RHOST:PORT  : 127.0.0.1:10041
MTU:        : 1500

PC6> save
Saving startup configuration to startup.vpc
.  done

PC6>
